# **Module 2 Assignment**

## **Data Importing, Cleaning, and Transforming**

Name: Tysen Heck
Student Number: 0373206

This assignment's purpose is to gain experience importing, exploring, cleaning, and transforming data with pandas.

## **Task 2: Data Importing**

**In this section, we will load the data into a pandas dataframe and display some basic information about the data**

---

### 1️⃣ **Loading the dataset into a pandas dataframe**

In [108]:
import pandas as pd

# Loads the csv file into a pandas dataframe
data = pd.read_csv("./Dataset_for_Module_2_Assignment.csv")

# Creates a pandas dataframe to use throughout the notebook
df = pd.DataFrame(data)

---

### 2️⃣ **Using `head()` to display the first 5 rows of data**

In [109]:
df.head()

,order_id,customer_name,order_date,total_amount,status,category,region,priority
0,1000,Grace Lee,2022-12-27,290.94,shipped,Furniture,North,Medium
1,1001,David Wilson,2022-10-13,369.45,PENDING,furniture,North,Low
2,1002,Henry Martin,2022-09-30,649.46,PENDING,furniture,West,Low
3,1003,Emma Davis,2023-01-04,575.07,Pending,garden,East,Low
4,1004,Grace Lee,2022-03-03,362.54,Shipped,electronics,South,High

---

### 3️⃣ **Using `shape` to display the amount of rows and columns in the data**

In [110]:
# Printing a formatted string with the dataset shape
print(f'This data contains {df.shape[0]} rows and {df.shape[1]} columns.')

This data contains 502 rows and 8 columns.

---

### 4️⃣ **Displaying the column names, data types, and amount of duplicate rows**

In [111]:
# Printing the columns in a comma-delimited list
print("The columns in this data are", ", ".join(str(column) for column in df.columns))

The columns in this data are order_id, customer_name, order_date, total_amount, status, category, region, priority

In [112]:
# Printing the column types
types = df.dtypes.reset_index()
types.columns = ['Column Name', 'Data Type']
print(types)

     Column Name Data Type
0       order_id     int64
1  customer_name    object
2     order_date    object
3   total_amount   float64
4         status    object
5       category    object
6         region    object
7       priority    object

In [113]:
# Printing the amount of duplicate rows in the dataset
df.duplicated().sum().item()

2

---

### 5️⃣ **Saving a copy of the dataset as an Excell file (.xlsx) using `to_excel()`**

In [114]:
df.to_excel("assignment_2_data_copy.xlsx", index=False)

---

## **Task 3: Dataset Exploration**

In this section, we will explore the dataset by:
- Summarizing the data
- Identifying missing values
- Finding the amount of unique values in the `status` and `category` columns
- Sorting the dataset by `total_amount` in descending order

---

### 1️⃣ **Summarizing the dataset with `info()` and `describe()`**

In [115]:
# This displays basic info about the dataset including columns, types entries, and memory usage
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 502 entries, 0 to 501
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   order_id       502 non-null    int64
 1   customer_name  502 non-null    object
 2   order_date     502 non-null    object
 3   total_amount   482 non-null    float64
 4   status         502 non-null    object
 5   category       502 non-null    object
 6   region         502 non-null    object
 7   priority       502 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 31.5+ KB

In [116]:
# Displays some basic stats about numeric columns (by default)
df.describe()

          order_id  total_amount
count   502.000000    482.000000
mean   1249.027888    505.015851
std     144.387754    288.669519
min    1000.000000     14.590000
25%    1124.250000    242.165000
50%    1248.500000    509.260000
75%    1373.750000    751.877500
max    1499.000000    997.950000

---

### 2️⃣ **Identifying missing values using `isna().sum()`**

In [117]:
# Displays the number of missing values in each column
df.isna().sum()

order_id          0
customer_name     0
order_date        0
total_amount     20
status            0
category          0
region            0
priority          0
dtype: int64

---

### 3️⃣ **Displaying the number of unique values in the `status` and `category` columns using `nunique()`**

In [118]:
df['status'].nunique()

8

In [119]:
df['category'].nunique()

7

---

### 4️⃣ **Sorting the data by `total_amount` in descending order using `sort_values()`**

In [120]:
df.sort_values(by="total_amount", ascending=False)

,order_id,customer_name,order_date,total_amount,status,category,region,priority
400,1398,Isabella White,2022-01-01,997.95,Cancelled,furniture,West,Low
193,1191,Grace Lee,2022-12-23,996.91,Pending,Furniture,West,High
450,1448,Alice Smith,2022-11-08,994.96,PENDING,GARDEN,East,High
434,1432,Jack Harris,2022-07-26,991.26,shipped,Furniture,West,Low
49,1049,Henry Martin,2022-08-11,990.06,PENDING,furniture,East,High
...,...,...,...,...,...,...,...,...
408,1406,Charlie Brown,2022-03-19,NaN,shipped,Furniture,North,Low
422,1420,David Wilson,2022-11-15,NaN,Shipped,garden,East,Low
435,1433,Charlie Brown,2022-10-30,NaN,PENDING,Electronics,South,Low
484,1482,Emma Davis,2022-03-09,NaN,Cancelled,Furniture,North,Low
489,1487,Charlie Brown,2022-05-26,NaN,CANCELLED,Furniture,South,Medium

---

## **Task 4: Data Cleaning**

In this section we will clean the data by:
- Removing duplicate rows
- Filling missing values in the `total_amount` column using the mean
- Converting the status column to lowercase values and removing whitespace
- Standardzing the category column by replacing variations with title-cased strings
- Displaying the cleaned data

---

### 1️⃣ **Removing the duplicates from the data using `drop_duplicates()`**

In [121]:
df.drop_duplicates()

,order_id,customer_name,order_date,total_amount,status,category,region,priority
0,1000,Grace Lee,2022-12-27,290.94,shipped,Furniture,North,Medium
1,1001,David Wilson,2022-10-13,369.45,PENDING,furniture,North,Low
2,1002,Henry Martin,2022-09-30,649.46,PENDING,furniture,West,Low
3,1003,Emma Davis,2023-01-04,575.07,Pending,garden,East,Low
4,1004,Grace Lee,2022-03-03,362.54,Shipped,electronics,South,High
...,...,...,...,...,...,...,...,...
497,1495,Alice Smith,2023-02-28,838.64,PENDING,electronics,West,Medium
498,1496,Grace Lee,2023-01-04,700.50,shipped,electronics,North,High
499,1497,Grace Lee,2022-08-24,683.34,shipped,GARDEN,North,Medium
500,1498,Isabella White,2022-03-24,622.43,Cancelled,Electronics,South,Low
501,1499,Charlie Brown,2022-02-11,755.19,Pending,Furniture,North,High

---

### 2️⃣ **Filling missing values in the `total_amount` column with the mean using `fillna()`**

In [122]:
# This is the way written in the notes but it throws a warning
# df['total_amount'].fillna(df['total_amount'].mean(), inplace=True)

# Creating a copy before any values are changed
df_copy = df.copy()

# This is the 'correct' way according to the 
df_copy.fillna({'total_amount': df['total_amount'].mean()})

,order_id,customer_name,order_date,total_amount,status,category,region,priority
0,1000,Grace Lee,2022-12-27,290.94,shipped,Furniture,North,Medium
1,1001,David Wilson,2022-10-13,369.45,PENDING,furniture,North,Low
2,1002,Henry Martin,2022-09-30,649.46,PENDING,furniture,West,Low
3,1003,Emma Davis,2023-01-04,575.07,Pending,garden,East,Low
4,1004,Grace Lee,2022-03-03,362.54,Shipped,electronics,South,High
...,...,...,...,...,...,...,...,...
497,1495,Alice Smith,2023-02-28,838.64,PENDING,electronics,West,Medium
498,1496,Grace Lee,2023-01-04,700.50,shipped,electronics,North,High
499,1497,Grace Lee,2022-08-24,683.34,shipped,GARDEN,North,Medium
500,1498,Isabella White,2022-03-24,622.43,Cancelled,Electronics,South,Low
501,1499,Charlie Brown,2022-02-11,755.19,Pending,Furniture,North,High

---

### 3️⃣ **Converting the `status` column values to lowercase and removing extra spaces**

In [123]:
df_copy['status'] = df_copy['status'].str.lower().str.strip()

---

### 4️⃣ **Standardizing the `category` column by replacing variations using `str.title()`**

In [124]:
df_copy['category'] = df_copy['category'].str.title().str.strip()

---

### 5️⃣ **Displaying the first 5 rows of the cleaned data**

In [125]:
df_copy.head()

,order_id,customer_name,order_date,total_amount,status,category,region,priority
0,1000,Grace Lee,2022-12-27,290.94,shipped,Furniture,North,Medium
1,1001,David Wilson,2022-10-13,369.45,pending,Furniture,North,Low
2,1002,Henry Martin,2022-09-30,649.46,pending,Furniture,West,Low
3,1003,Emma Davis,2023-01-04,575.07,pending,Garden,East,Low
4,1004,Grace Lee,2022-03-03,362.54,shipped,Electronics,South,High

---

## **Task 5: Data Type Conversions & Transformations**

In this section we will convert and transform the data by:
- Converting the `total_amount` column to a float type
- Converting the `order_date` column to datetime format
- Extracting the year from `order_date` and inserting it into a new `order_year` column
- Encoding the `status` column using One-Hot Encoding
- Label encoding the `priority` column using `LabelEncoder`

---

### 1️⃣ **Converting the `total_amount` column values to a float using `pd.to_numeric()`**

In [126]:
df_copy['total_amount'] = pd.to_numeric(df_copy['total_amount'], errors='coerce')

In [127]:
# Confirming that the change occured on the dataset

types = df_copy.dtypes.reset_index()
types.columns = ['Column Name', 'Data Type']
print(types)

     Column Name Data Type
0       order_id     int64
1  customer_name    object
2     order_date    object
3   total_amount   float64
4         status    object
5       category    object
6         region    object
7       priority    object

---

### 2️⃣ **Converting the `order_date` column to a datetime format using `pd.to_datetime()`**

In [128]:
# Made without the 'infer_datetime_format' arg as it's deprecated and that is the default behaviour now
df_copy['order_date(formatted)'] = pd.to_datetime(df_copy['order_date'], errors="coerce")

In [129]:
# Confirming that the change occured on the dataset
types = df_copy.dtypes.reset_index()
types.columns = ['Column Name', 'Data Type']
print(types)

             Column Name       Data Type
0               order_id           int64
1          customer_name          object
2             order_date          object
3           total_amount         float64
4                 status          object
5               category          object
6                 region          object
7               priority          object
8  order_date(formatted)  datetime64[ns]

---

### 3️⃣ **Extrating the year from `order_date` and creating a `order_year` column with the year**

In [130]:
import numpy as np

def extract_year(date):
    if pd.notnull(date):
        return date.year
    return np.nan

df_copy['order_year']= df_copy['order_date(formatted)'].apply(extract_year)

df_copy.head()

,order_id,customer_name,order_date,total_amount,status,category,region,priority,order_date(formatted),order_year
0,1000,Grace Lee,2022-12-27,290.94,shipped,Furniture,North,Medium,2022-12-27,2022
1,1001,David Wilson,2022-10-13,369.45,pending,Furniture,North,Low,2022-10-13,2022
2,1002,Henry Martin,2022-09-30,649.46,pending,Furniture,West,Low,2022-09-30,2022
3,1003,Emma Davis,2023-01-04,575.07,pending,Garden,East,Low,2023-01-04,2023
4,1004,Grace Lee,2022-03-03,362.54,shipped,Electronics,South,High,2022-03-03,2022

---

### 4️⃣ **Encoding the `status` column using One-Hot Encoding (`pd.get_dummies()`)**

In [131]:
df_copy = pd.get_dummies(df_copy, columns=['status'])

df_copy.head()

,order_id,customer_name,order_date,total_amount,category,region,priority,order_date(formatted),order_year,status_cancelled,status_pending,status_shipped
0,1000,Grace Lee,2022-12-27,290.94,Furniture,North,Medium,2022-12-27,2022,False,False,True
1,1001,David Wilson,2022-10-13,369.45,Furniture,North,Low,2022-10-13,2022,False,True,False
2,1002,Henry Martin,2022-09-30,649.46,Furniture,West,Low,2022-09-30,2022,False,True,False
3,1003,Emma Davis,2023-01-04,575.07,Garden,East,Low,2023-01-04,2023,False,True,False
4,1004,Grace Lee,2022-03-03,362.54,Electronics,South,High,2022-03-03,2022,False,False,True

---

### 5️⃣ **Label encoding the `priority` column using `LabelEncoder` from `sklearn`**

In [132]:
from sklearn.preprocessing import LabelEncoder

encoder = LabelEncoder()
df_copy['priority_encoded'] = encoder.fit_transform(df_copy['priority'].astype(str))

df_copy.head()

,order_id,customer_name,order_date,total_amount,category,region,priority,order_date(formatted),order_year,status_cancelled,status_pending,status_shipped,priority_encoded
0,1000,Grace Lee,2022-12-27,290.94,Furniture,North,Medium,2022-12-27,2022,False,False,True,2
1,1001,David Wilson,2022-10-13,369.45,Furniture,North,Low,2022-10-13,2022,False,True,False,1
2,1002,Henry Martin,2022-09-30,649.46,Furniture,West,Low,2022-09-30,2022,False,True,False,1
3,1003,Emma Davis,2023-01-04,575.07,Garden,East,Low,2023-01-04,2023,False,True,False,1
4,1004,Grace Lee,2022-03-03,362.54,Electronics,South,High,2022-03-03,2022,False,False,True,0